In [3]:
import numpy as np
import pandas as pd

In [5]:
np.arange(0, 10)
np.arange(0, 10).reshape(2, 5)

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

In [11]:
data = [40, 34, 25]
indeks = ["A", "B", "C"]
series = pd.Series(data, indeks)
series

A    40
B    34
C    25
dtype: int64

In [20]:
series[["A", "B"]]

A    40
B    34
dtype: int64

In [19]:
series[0]

40

In [21]:
series[[0, 2]]

A    40
C    25
dtype: int64

In [47]:
data2 = [[40, 37, 78], [34, 39, 22], [25, 33, 37]]
indeks2 = ["A", "B", "C"]
colomns = ["Colomn1", "Colomn2", "Colomn3"]
dataframe1 = pd.DataFrame(data2, indeks2, colomns)
dataframe1

   Colomn1  Colomn2  Colomn3
A       40       37       78
B       34       39       22
C       25       33       37

In [53]:
dataframe1["Total"] = dataframe1["Colomn1"] + dataframe1["Colomn2"] + dataframe1["Colomn3"]

In [61]:
dataframe1.drop("Colomn4", axis=1, inplace=True)

In [62]:
dataframe1

   Colomn1  Colomn2  Colomn3  Total
A       40       37       78    155
B       34       39       22     95
C       25       33       37     95